In [1]:
#1 Ler o Dataset  ordens de Sanduiche
#2 agrupar conta(valor total) por ordem_id
#3 agrupar quantidade de items por ordem_id

In [3]:
import pandas as panda
import numpy

#antes de começar, analise o arquivo e veja quais tipos de mudaças devem ser feito no mesmo para resolver os exercios
arqSanduiche = panda.read_table('C:\GIT\DataScience\Datasets\Sanduiches.txt')
arqSanduiche.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
arqSanduiche.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [5]:
#logica do replace:         *dataFrame --[coluna------] = dataframe-- .coluna---.str.replace('str a ser subtituida', 'newvalor')

arqSanduiche['item_price'] = arqSanduiche['item_price'] = arqSanduiche.item_price.str.replace('$','') #pode converter com astype
                                                                                                      #no final da linha ex:
                                                                                                      #.astype(float)

In [6]:
arqSanduiche.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [7]:
#Coverter - convertendo uma serie inteira com ASTYPE

#lotica                       dataframe---nome-coluna.astype(float)
arqSanduiche['item_price'] =  arqSanduiche.item_price.astype(float)
arqSanduiche.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [8]:
arqSanduiche.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

In [12]:
#2 agrupar conta(valor total) por ordem_id

arqSanduiche.groupby('order_id').item_price.sum().head(5)

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

In [13]:
#3 agrupar quantidade de items por ordem_id

arqSanduiche.groupby('order_id').quantity.sum().head(5)

order_id
1    4
2    2
3    2
4    2
5    2
Name: quantity, dtype: int64

In [14]:
#Dados estasticos 

arqSanduiche.groupby('order_id').item_price.agg(['count','mean','max','min'])

          count       mean    max    min
order_id
1             4   2.890000   3.39   2.39
2             1  16.980000  16.98  16.98
3             2   6.335000  10.98   1.69
4             2  10.500000  11.75   9.25
5             2   6.850000   9.25   4.45
...         ...        ...    ...    ...
1830          2  11.500000  11.75  11.25
1831          3   4.300000   9.25   1.50
1832          2   6.600000   8.75   4.45
1833          2  11.750000  11.75  11.75
1834          3   9.583333  11.25   8.75

[1834 rows x 4 columns]